#1. Создать список и заполнить его элементами различных типов данных. 
# Реализовать скрипт проверки типа данных каждого элемента. 
# Использовать функцию type() для проверки типа. 
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.

new_list = ["тип данных строка", 1, 0.5, True, [], ()]

for item in new_list:
    print(type(item))